#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
#include<string.h>
#define SIZE 512
#include "task8.h"
int main(int argc, char *argv[])
{
	if (argc == 1)
	{
		printf("ERROR data, input again...");
		return 1;
	}

	printf("%i\n", eval(argv[1]));
	
/*int main()
{
	int argc = 2;
	if (argc == 1)
	{
		printf("ERROR data, input again...");
		return 1;
	}
	char *p; 
	p = "(2+(22))" ;

 	printf("%i\n", eval(p));*/
	return 0;
}
/*
Написать программу, которая вычисляет целочисленный результат арифметического выражения, заданного в виде параметра команд-
ной строки. Предусмотреть поддержку 4-х основных операций. Порядок вычисления определяется круглыми скобками
Замечание:
В строке выражения могут встречаться символы: 0-9,+,-,*,/,(,) Выражения могут быть простыми, то есть целиком состоять
из одного числа 3, 8, а могут быть сложными, например, ((6+8)*3) или (((7-1)/(4+2))-9). Предполагается, что скобки в 
выражении заданы правильно, то есть количество открытых равно количеству закрытых и они на допустимых позициях.
Программа должна состоять из следующих функций:
(a) int main(int argc, char* argv[]) - главная функция, в которой осуществляется вызов рекурсивной функции eval для вычисления выражения
(b) int eval(char *buf) - функция, вычисляющая строку, содержащуюся в buf
(c) char partition(char *buf, char *expr1, char *expr2) - функция, которая разбивает строку, содержащуюся в buf на три части: 
строку с первым операндом, знак операции и строку со вторым операндом
*/